ProjectMurzik/xiaoclaw/sdkconfig.defaults
# ---------------------------------------------------------
# ESP-IDF v5.5 sdkconfig.defaults для Murzik (ESP32-P4 + xiaoclaw)
# Финальная версия: подключение к xiaozhi.me + блокировка OTA + сжатие бутлоадера
# ---------------------------------------------------------

# 1. Target & System
# ---------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_INTERRUPT_BACKTRACE=n
CONFIG_FREERTOS_CORETIMER_SYSTICK_LVL=3

# 2. Flash & PSRAM (КРИТИЧНО для P4)
# ---------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=n
CONFIG_SPIRAM_RODATA=n
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_USE_CAPS_ALLOC=n
CONFIG_SPIRAM_IGNORE_NOTFOUND=n

# 3. Partition Table (64KB под бутлоадер)
# ---------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000        # <-- 64KB под bootloader
CONFIG_PARTITION_TABLE_MD5=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n      # <-- Отключено: без OTA не нужен

# 4. Wi-Fi 6 & Network & Server
# ---------------------------------------------------------
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_11AX_SUPPORT=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
CONFIG_ESP_WIFI_SLP_IRAM_OPT=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_LWIP_LOCAL_HOSTNAME="murzik"
CONFIG_LWIP_DHCP=y
CONFIG_LWIP_DNS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y
CONFIG_ESP_WS_CLIENT_ENABLE_TLS=y

# 🔥 Server Configuration (Xiaozhi Cloud)
# ---------------------------------------------------------
CONFIG_MIMI_SERVER_URL="wss://api.xiaozhi.me:443/v1"

# 5. 🔥 CRITICAL: Board Selection
# ---------------------------------------------------------
CONFIG_BOARD_TYPE_WAVESHARE_ESP32_P4_WIFI6_TOUCH_LCD_3_4C=y

# 6. Display & LVGL
# ---------------------------------------------------------
CONFIG_LCD_ENABLE=y
CONFIG_LCD_MIPI_DSI=y
CONFIG_LCD_MIPI_DSI_PHY_DUAL_LANE=y
CONFIG_LVGL_ENABLE=y
CONFIG_LVGL_COLOR_DEPTH=16
CONFIG_LVGL_BITS_PER_PIXEL=16
CONFIG_LVGL_DRAW_BUF_SIZE=200000
CONFIG_LVGL_MEM_POOL_INCLUDE_SPIRAM_HEAP=y
CONFIG_LVGL_TICK_PERIOD_MS=5
CONFIG_LVGL_DPI=96
CONFIG_LVGL_ANTIALIAS=1
CONFIG_LVGL_DISP_DEF_REFR_PERIOD=30
CONFIG_LVGL_USE_IMGFONT=n
CONFIG_LV_FONT_FMT_TXT_LARGE=y

# 7. Audio (I2S) & Processing
# ---------------------------------------------------------
CONFIG_ESP_I2S_ENABLE=y
CONFIG_ESP_I2S_SUPPORTS_LEGACY=n
CONFIG_ESP_I2S_ISR_IRAM_SAFE=y
CONFIG_ESP_I2S_SUPPORTS_APLL=y
CONFIG_USE_AUDIO_PROCESSOR=y

# 8. ESP-SR (Voice) - Отключено
# ---------------------------------------------------------
CONFIG_ESP_SR_ENABLE=n

# 9. Language & Assets
# ---------------------------------------------------------
CONFIG_LANGUAGE_EN_US=y
CONFIG_FLASH_DEFAULT_ASSETS=n

# 10. Logging, Debug & Compiler Options
# ---------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_COMPILER_OPTIMIZATION_PERF=y        # <-- Приложение: оптимизация на скорость (-O2/-O3)
CONFIG_STACK_CHECK_NONE=y
CONFIG_BROWNOUT_DET=y
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_COMPILER_WARNINGS_AS_ERRORS=n
CONFIG_COMPILER_CXX_RTTI=y

# 🔥 УЛЬТРА-СЖАТИЕ БУТЛОАДЕРА (экономия ~2–5 КБ)
# ---------------------------------------------------------
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y         # <-- Вырезает все логи из бутлоадера (~3–8 КБ экономии)
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y  # <-- Бутлоадер: оптимизация на размер (-Os)

# 🔒 OTA & Update Lockdown (Защита от случайной перепрошивки)
# ---------------------------------------------------------
CONFIG_APP_OTA_ROLLBACK_ENABLE=n
CONFIG_ENABLE_OTA=n
